.openhands/commands.org
#+TITLE: 便利なコマンド
#+STARTUP: content

* 便利なコマンド

** Hugoコマンド

#+begin_src bash
# ローカル開発用のHugoサーバーを起動
hugo server -D --port 52112 --bind 0.0.0.0 --disableFastRender

# サイトをビルド
hugo

# 新しい投稿を作成
hugo new posts/my-new-post.md
#+end_src

** Gitコマンド

#+begin_src bash
# テーマのサブモジュールを更新
git submodule update --remote --recursive

# サブモジュールの初期化（必要な場合）
git submodule init
git submodule update
#+end_src

** Node.jsコマンド

#+begin_src bash
# 依存関係をインストール
npm install

# シークレットリンティングを実行
npm run lint:secret
#+end_src

** コンテンツ生成

#+begin_src bash
# org-modeとox-hugoを使用している場合、orgファイルをHugoマークダウンにエクスポート
# これは通常Emacs内で行われます
#+end_src

** デプロイメント

サイトはGitHub Pagesにデプロイされています。デプロイプロセスはGitHub Actionsまたは類似のCI/CDパイプラインを通じて処理されていると思われます。